Continued plan output from previous comment.
<details><summary>Show Output</summary>

```diff
  # (20 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-getInfo.aws_cloudwatch_log_group.lambda[0] has been deleted
  - resource "aws_cloudwatch_log_group" "lambda" {
      - arn               = "arn:aws:logs:ap-southeast-3:496940679572:log-group:/aws/lambda/sbeacon-backend-getInfo" -> null
        id                = "/aws/lambda/sbeacon-backend-getInfo"
      - name              = "/aws/lambda/sbeacon-backend-getInfo" -> null
        tags              = {
            "Environment" = "dev"
            "NAME"        = "sbeacon-backend"
            "Owner"       = "gaspi"
        }
        # (7 unchanged attributes hidden)
    }

  # module.sbeacon.module.lambda-getInfo.aws_iam_role.lambda[0] has been deleted
  - resource "aws_iam_role" "lambda" {
      - arn                   = "arn:aws:iam::496940679572:role/sbeacon-backend-getInfo" -> null
        id                    = "sbeacon-backend-getInfo"
      - name                  = "sbeacon-backend-getInfo" -> null
        tags                  = {
            "Environment" = "dev"
            "NAME"        = "sbeacon-backend"
            "Owner"       = "gaspi"
        }
      - unique_id             = "AROAXHM7ZAGKLNORPYXXF" -> null
        # (10 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.sbeacon.module.lambda-getInfo.aws_lambda_function.this[0] has been deleted
  - resource "aws_lambda_function" "this" {
      - arn                            = "arn:aws:lambda:ap-southeast-3:496940679572:function:sbeacon-backend-getInfo" -> null
      - function_name                  = "sbeacon-backend-getInfo" -> null
        id                             = "sbeacon-backend-getInfo"
      - invoke_arn                     = "arn:aws:apigateway:ap-southeast-3:lambda:path/2015-03-31/functions/arn:aws:lambda:ap-southeast-3:496940679572:function:sbeacon-backend-getInfo/invocations" -> null
      - last_modified                  = "2025-08-18T02:41:17.000+0000" -> null
      - qualified_arn                  = "arn:aws:lambda:ap-southeast-3:496940679572:function:sbeacon-backend-getInfo:$LATEST" -> null
      - qualified_invoke_arn           = "arn:aws:apigateway:ap-southeast-3:lambda:path/2015-03-31/functions/arn:aws:lambda:ap-southeast-3:496940679572:function:sbeacon-backend-getInfo:$LATEST/invocations" -> null
      - source_code_hash               = "Ma9RB2UkX1LLytrGIxm3RubGTb3KLJIfOkYZAdMHYk4=" -> null
      - source_code_size               = 392 -> null
        tags                           = {
            "Environment"           = "dev"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
      - version                        = "$LATEST" -> null
        # (20 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-getMap.aws_cloudwatch_log_group.lambda[0] has been deleted
  - resource "aws_cloudwatch_log_group" "lambda" {
      - arn               = "arn:aws:logs:ap-southeast-3:496940679572:log-group:/aws/lambda/sbeacon-backend-getMap" -> null
        id                = "/aws/lambda/sbeacon-backend-getMap"
      - name              = "/aws/lambda/sbeacon-backend-getMap" -> null
        tags              = {
            "Environment" = "dev"
            "NAME"        = "sbeacon-backend"
            "Owner"       = "gaspi"
        }
        # (7 unchanged attributes hidden)
    }

  # module.sbeacon.module.lambda-getMap.aws_iam_role.lambda[0] has been deleted
  - resource "aws_iam_role" "lambda" {
      - arn                   = "arn:aws:iam::496940679572:role/sbeacon-backend-getMap" -> null
        id                    = "sbeacon-backend-getMap"
      - name                  = "sbeacon-backend-getMap" -> null
        tags                  = {
            "Environment" = "dev"
            "NAME"        = "sbeacon-backend"
            "Owner"       = "gaspi"
        }
      - unique_id             = "AROAXHM7ZAGKN7FZVTOZA" -> null
        # (10 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.sbeacon.module.lambda-getMap.aws_lambda_function.this[0] has been deleted
  - resource "aws_lambda_function" "this" {
      - arn                            = "arn:aws:lambda:ap-southeast-3:496940679572:function:sbeacon-backend-getMap" -> null
      - function_name                  = "sbeacon-backend-getMap" -> null
        id                             = "sbeacon-backend-getMap"
      - invoke_arn                     = "arn:aws:apigateway:ap-southeast-3:lambda:path/2015-03-31/functions/arn:aws:lambda:ap-southeast-3:496940679572:function:sbeacon-backend-getMap/invocations" -> null
      - last_modified                  = "2025-08-18T02:41:35.000+0000" -> null
      - qualified_arn                  = "arn:aws:lambda:ap-southeast-3:496940679572:function:sbeacon-backend-getMap:$LATEST" -> null
      - qualified_invoke_arn           = "arn:aws:apigateway:ap-southeast-3:lambda:path/2015-03-31/functions/arn:aws:lambda:ap-southeast-3:496940679572:function:sbeacon-backend-getMap:$LATEST/invocations" -> null
      - source_code_hash               = "hfmJFbNYR7XkQOA/FbtCjKE+pNJ0wBej9odSEMxJ3iI=" -> null
      - source_code_size               = 309 -> null
        tags                           = {
            "Environment"           = "dev"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
      - version                        = "$LATEST" -> null
        # (20 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-getProjects.aws_iam_role.lambda[0] has been deleted
  - resource "aws_iam_role" "lambda" {
      - arn                   = "arn:aws:iam::496940679572:role/sbeacon-backend-getProjects" -> null
        id                    = "sbeacon-backend-getProjects"
      - name                  = "sbeacon-backend-getProjects" -> null
        tags                  = {
            "Environment" = "dev"
            "NAME"        = "sbeacon-backend"
            "Owner"       = "gaspi"
        }
      - unique_id             = "AROAXHM7ZAGKEWL4LVYKQ" -> null
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-getRuns.aws_cloudwatch_log_group.lambda[0] has been deleted
  - resource "aws_cloudwatch_log_group" "lambda" {
      - arn               = "arn:aws:logs:ap-southeast-3:496940679572:log-group:/aws/lambda/sbeacon-backend-getRuns" -> null
        id                = "/aws/lambda/sbeacon-backend-getRuns"
      - name              = "/aws/lambda/sbeacon-backend-getRuns" -> null
        tags              = {
            "Environment" = "dev"
            "NAME"        = "sbeacon-backend"
            "Owner"       = "gaspi"
        }
        # (7 unchanged attributes hidden)
    }

  # module.sbeacon.module.lambda-getRuns.aws_iam_role.lambda[0] has been deleted
  - resource "aws_iam_role" "lambda" {
      - arn                   = "arn:aws:iam::496940679572:role/sbeacon-backend-getRuns" -> null
        id                    = "sbeacon-backend-getRuns"
      - name                  = "sbeacon-backend-getRuns" -> null
        tags                  = {
            "Environment" = "dev"
            "NAME"        = "sbeacon-backend"
            "Owner"       = "gaspi"
        }
      - unique_id             = "AROAXHM7ZAGKNJZ4GRAQY" -> null
        # (10 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-getRuns.aws_lambda_function.this[0] has been deleted
  - resource "aws_lambda_function" "this" {
      - arn                            = "arn:aws:lambda:ap-southeast-3:496940679572:function:sbeacon-backend-getRuns" -> null
      - function_name                  = "sbeacon-backend-getRuns" -> null
        id                             = "sbeacon-backend-getRuns"
      - invoke_arn                     = "arn:aws:apigateway:ap-southeast-3:lambda:path/2015-03-31/functions/arn:aws:lambda:ap-southeast-3:496940679572:function:sbeacon-backend-getRuns/invocations" -> null
      - last_modified                  = "2025-08-18T02:41:41.000+0000" -> null
      - qualified_arn                  = "arn:aws:lambda:ap-southeast-3:496940679572:function:sbeacon-backend-getRuns:$LATEST" -> null
      - qualified_invoke_arn           = "arn:aws:apigateway:ap-southeast-3:lambda:path/2015-03-31/functions/arn:aws:lambda:ap-southeast-3:496940679572:function:sbeacon-backend-getRuns:$LATEST/invocations" -> null
      - source_code_hash               = "lhZLUByNwYTx0FWJk4CzugGdUg9rsygYigjZxS0Bao4=" -> null
      - source_code_size               = 5985 -> null
        tags                           = {
            "Environment"           = "dev"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
      - version                        = "$LATEST" -> null
        # (20 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-indexer.aws_cloudwatch_log_group.lambda[0] has been deleted
  - resource "aws_cloudwatch_log_group" "lambda" {
      - arn               = "arn:aws:logs:ap-southeast-3:496940679572:log-group:/aws/lambda/sbeacon-backend-indexer" -> null
        id                = "/aws/lambda/sbeacon-backend-indexer"
      - name              = "/aws/lambda/sbeacon-backend-indexer" -> null
        tags              = {
            "Environment" = "dev"
            "NAME"        = "sbeacon-backend"
            "Owner"       = "gaspi"
        }
        # (7 unchanged attributes hidden)
    }

  # module.sbeacon.module.lambda-indexer.aws_iam_role.lambda[0] has been deleted
  - resource "aws_iam_role" "lambda" {
      - arn                   = "arn:aws:iam::496940679572:role/sbeacon-backend-indexer" -> null
        id                    = "sbeacon-backend-indexer"
      - name                  = "sbeacon-backend-indexer" -> null
        tags                  = {
            "Environment" = "dev"
            "NAME"        = "sbeacon-backend"
            "Owner"       = "gaspi"
        }
      - unique_id             = "AROAXHM7ZAGKPS4BDBYVS" -> null
        # (10 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-indexer.aws_lambda_function.this[0] has been deleted
  - resource "aws_lambda_function" "this" {
      - arn                            = "arn:aws:lambda:ap-southeast-3:496940679572:function:sbeacon-backend-indexer" -> null
      - function_name                  = "sbeacon-backend-indexer" -> null
        id                             = "sbeacon-backend-indexer"
      - invoke_arn                     = "arn:aws:apigateway:ap-southeast-3:lambda:path/2015-03-31/functions/arn:aws:lambda:ap-southeast-3:496940679572:function:sbeacon-backend-indexer/invocations" -> null
      - last_modified                  = "2025-08-18T02:41:17.000+0000" -> null
      - qualified_arn                  = "arn:aws:lambda:ap-southeast-3:496940679572:function:sbeacon-backend-indexer:$LATEST" -> null
      - qualified_invoke_arn           = "arn:aws:apigateway:ap-southeast-3:lambda:path/2015-03-31/functions/arn:aws:lambda:ap-southeast-3:496940679572:function:sbeacon-backend-indexer:$LATEST/invocations" -> null
      - source_code_hash               = "wmQy2czg7giZbPx/epbuW5hPnAq4816hBJ7osvMEs/U=" -> null
      - source_code_size               = 5149 -> null
        tags                           = {
            "Environment"           = "dev"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
      - version                        = "$LATEST" -> null
        # (20 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-performQuery.aws_cloudwatch_log_group.lambda[0] has been deleted
  - resource "aws_cloudwatch_log_group" "lambda" {
      - arn               = "arn:aws:logs:ap-southeast-3:496940679572:log-group:/aws/lambda/sbeacon-backend-performQuery" -> null
        id                = "/aws/lambda/sbeacon-backend-performQuery"
      - name              = "/aws/lambda/sbeacon-backend-performQuery" -> null
        tags              = {
            "Environment" = "dev"
            "NAME"        = "sbeacon-backend"
            "Owner"       = "gaspi"
        }
        # (7 unchanged attributes hidden)
    }

  # module.sbeacon.module.lambda-performQuery.aws_iam_role.lambda[0] has been deleted
  - resource "aws_iam_role" "lambda" {
      - arn                   = "arn:aws:iam::496940679572:role/sbeacon-backend-performQuery" -> null
        id                    = "sbeacon-backend-performQuery"
      - name                  = "sbeacon-backend-performQuery" -> null
        tags                  = {
            "Environment" = "dev"
            "NAME"        = "sbeacon-backend"
            "Owner"       = "gaspi"
        }
      - unique_id             = "AROAXHM7ZAGKMS3RHX5F4" -> null
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-performQuery.aws_lambda_function.this[0] has been deleted
  - resource "aws_lambda_function" "this" {
      - arn                            = "arn:aws:lambda:ap-southeast-3:496940679572:function:sbeacon-backend-performQuery" -> null
      - function_name                  = "sbeacon-backend-performQuery" -> null
        id                             = "sbeacon-backend-performQuery"
      - invoke_arn                     = "arn:aws:apigateway:ap-southeast-3:lambda:path/2015-03-31/functions/arn:aws:lambda:ap-southeast-3:496940679572:function:sbeacon-backend-performQuery/invocations" -> null
      - last_modified                  = "2025-08-18T02:41:16.000+0000" -> null
      - qualified_arn                  = "arn:aws:lambda:ap-southeast-3:496940679572:function:sbeacon-backend-performQuery:$LATEST" -> null
      - qualified_invoke_arn           = "arn:aws:apigateway:ap-southeast-3:lambda:path/2015-03-31/functions/arn:aws:lambda:ap-southeast-3:496940679572:function:sbeacon-backend-performQuery:$LATEST/invocations" -> null
      - source_code_hash               = "YEL792yk2IZ+1/gntA2OQ7WtR8Q4kLSNyQvlI4t2QaQ=" -> null
      - source_code_size               = 3912 -> null
        tags                           = {
            "Environment"           = "dev"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
      - version                        = "$LATEST" -> null
        # (20 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-splitQuery.aws_cloudwatch_log_group.lambda[0] has been deleted
  - resource "aws_cloudwatch_log_group" "lambda" {
      - arn               = "arn:aws:logs:ap-southeast-3:496940679572:log-group:/aws/lambda/sbeacon-backend-splitQuery" -> null
        id                = "/aws/lambda/sbeacon-backend-splitQuery"
      - name              = "/aws/lambda/sbeacon-backend-splitQuery" -> null
        tags              = {
            "Environment" = "dev"
            "NAME"        = "sbeacon-backend"
            "Owner"       = "gaspi"
        }
        # (7 unchanged attributes hidden)
    }

  # module.sbeacon.module.lambda-splitQuery.aws_iam_role.lambda[0] has been deleted
  - resource "aws_iam_role" "lambda" {
      - arn                   = "arn:aws:iam::496940679572:role/sbeacon-backend-splitQuery" -> null
        id                    = "sbeacon-backend-splitQuery"
      - name                  = "sbeacon-backend-splitQuery" -> null
        tags                  = {
            "Environment" = "dev"
            "NAME"        = "sbeacon-backend"
            "Owner"       = "gaspi"
        }
      - unique_id             = "AROAXHM7ZAGKODS4KOJSB" -> null
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-splitQuery.aws_lambda_function.this[0] has been deleted
  - resource "aws_lambda_function" "this" {
      - arn                            = "arn:aws:lambda:ap-southeast-3:496940679572:function:sbeacon-backend-splitQuery" -> null
      - function_name                  = "sbeacon-backend-splitQuery" -> null
        id                             = "sbeacon-backend-splitQuery"
      - invoke_arn                     = "arn:aws:apigateway:ap-southeast-3:lambda:path/2015-03-31/functions/arn:aws:lambda:ap-southeast-3:496940679572:function:sbeacon-backend-splitQuery/invocations" -> null
      - last_modified                  = "2025-08-18T02:41:35.000+0000" -> null
      - qualified_arn                  = "arn:aws:lambda:ap-southeast-3:496940679572:function:sbeacon-backend-splitQuery:$LATEST" -> null
      - qualified_invoke_arn           = "arn:aws:apigateway:ap-southeast-3:lambda:path/2015-03-31/functions/arn:aws:lambda:ap-southeast-3:496940679572:function:sbeacon-backend-splitQuery:$LATEST/invocations" -> null
      - source_code_hash               = "ZFvJ4PdNWfSyl10J2T0pv0+2EAebbgXSOESMvKmNj1U=" -> null
      - source_code_size               = 805 -> null
        tags                           = {
            "Environment"           = "dev"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
      - version                        = "$LATEST" -> null
        # (20 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-submitDataset.aws_cloudwatch_log_group.lambda[0] has been deleted
  - resource "aws_cloudwatch_log_group" "lambda" {
      - arn               = "arn:aws:logs:ap-southeast-3:496940679572:log-group:/aws/lambda/sbeacon-backend-submitDataset" -> null
        id                = "/aws/lambda/sbeacon-backend-submitDataset"
      - name              = "/aws/lambda/sbeacon-backend-submitDataset" -> null
        tags              = {
            "Environment" = "dev"
            "NAME"        = "sbeacon-backend"
            "Owner"       = "gaspi"
        }
        # (7 unchanged attributes hidden)
    }

  # module.sbeacon.module.lambda-submitDataset.aws_iam_role.lambda[0] has been deleted
  - resource "aws_iam_role" "lambda" {
      - arn                   = "arn:aws:iam::496940679572:role/sbeacon-backend-submitDataset" -> null
        id                    = "sbeacon-backend-submitDataset"
      - name                  = "sbeacon-backend-submitDataset" -> null
        tags                  = {
            "Environment" = "dev"
            "NAME"        = "sbeacon-backend"
            "Owner"       = "gaspi"
        }
      - unique_id             = "AROAXHM7ZAGKPGBXXPE4Z" -> null
        # (10 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-submitDataset.aws_lambda_function.this[0] has been deleted
  - resource "aws_lambda_function" "this" {
      - arn                            = "arn:aws:lambda:ap-southeast-3:496940679572:function:sbeacon-backend-submitDataset" -> null
      - function_name                  = "sbeacon-backend-submitDataset" -> null
        id                             = "sbeacon-backend-submitDataset"
      - invoke_arn                     = "arn:aws:apigateway:ap-southeast-3:lambda:path/2015-03-31/functions/arn:aws:lambda:ap-southeast-3:496940679572:function:sbeacon-backend-submitDataset/invocations" -> null
      - last_modified                  = "2025-08-18T02:41:35.000+0000" -> null
      - qualified_arn                  = "arn:aws:lambda:ap-southeast-3:496940679572:function:sbeacon-backend-submitDataset:$LATEST" -> null
      - qualified_invoke_arn           = "arn:aws:apigateway:ap-southeast-3:lambda:path/2015-03-31/functions/arn:aws:lambda:ap-southeast-3:496940679572:function:sbeacon-backend-submitDataset:$LATEST/invocations" -> null
      - source_code_size               = 0 -> null
        tags                           = {
            "Environment"           = "dev"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
      - version                        = "$LATEST" -> null
        # (20 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-updateFiles.aws_iam_role.lambda[0] has been deleted
  - resource "aws_iam_role" "lambda" {
      - arn                   = "arn:aws:iam::496940679572:role/sbeacon-backend-updateFiles" -> null
        id                    = "sbeacon-backend-updateFiles"
      - name                  = "sbeacon-backend-updateFiles" -> null
        tags                  = {
            "Environment" = "dev"
            "NAME"        = "sbeacon-backend"
            "Owner"       = "gaspi"
        }
      - unique_id             = "AROAXHM7ZAGKJVX2ZE2TH" -> null
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.pgxflow[0].module.pipeline_pharmcat.module.docker_image_pharmcat_lambda.docker_image.this has been deleted
  - resource "docker_image" "this" {
        id           = "sha256:4561959ba620e43b820e9c49b57cbd7a0a37ab8949b405fd7348cde523e0da8f496940679572.dkr.ecr.ap-southeast-3.amazonaws.com/pgxflow-pharmcat-lambda-containers"
      - image_id     = "sha256:4561959ba620e43b820e9c49b57cbd7a0a37ab8949b405fd7348cde523e0da8f" -> null
      - name         = "496940679572.dkr.ecr.ap-southeast-3.amazonaws.com/pgxflow-pharmcat-lambda-containers" -> null
        # (4 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.pgxflow[0].module.pipeline_pharmcat.module.docker_image_preprocessor_lambda.docker_image.this has been deleted
  - resource "docker_image" "this" {
        id           = "sha256:367fb58a421ab1636c7fe7bc515ab53f5452e55b2ad1addff221784a9799499b496940679572.dkr.ecr.ap-southeast-3.amazonaws.com/pgxflow-preprocessor-lambda-containers"
      - image_id     = "sha256:367fb58a421ab1636c7fe7bc515ab53f5452e55b2ad1addff221784a9799499b" -> null
      - name         = "496940679572.dkr.ecr.ap-southeast-3.amazonaws.com/pgxflow-preprocessor-lambda-containers" -> null
        # (4 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement
+/- create replacement and then destroy
 <= read (data resources)

Terraform will perform the following actions:

  # aws_backup_plan.gaspi_backup_plan will be updated in-place
  ~ resource "aws_backup_plan" "gaspi_backup_plan" {
        id       = "8abdd60c-66f8-4a44-83bb-1ba59255bf3b"
        name     = "gaspi_backup_plan"
      ~ tags     = {
          ~ "Environment" = "dev" -> "uat"
            "Owner"       = "gaspi"
        }
      ~ tags_all = {
          ~ "Environment" = "dev" -> "uat"
            # (1 unchanged element hidden)
        }
        # (3 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # aws_backup_vault.gaspi_backup_vault will be updated in-place
  ~ resource "aws_backup_vault" "gaspi_backup_vault" {
        id              = "gaspi_backup_vault"
        name            = "gaspi_backup_vault"
      ~ tags            = {
          ~ "Environment" = "dev" -> "uat"
            "Owner"       = "gaspi"
        }
      ~ tags_all        = {
          ~ "Environment" = "dev" -> "uat"
            # (1 unchanged element hidden)
        }
        # (5 unchanged attributes hidden)
    }

  # module.cognito.data.aws_iam_policy_document.admin_group_assume_role_policy will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "admin_group_assume_role_policy" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions = [
              + "sts:AssumeRoleWithWebIdentity",
            ]

          + condition {
              + test     = "ForAnyValue:StringLike"
              + values   = [
                  + "authenticated",
                ]
              + variable = "cognito-identity.amazonaws.com:amr"
            }
          + condition {
              + test     = "StringEquals"
              + values   = [
                  + "ap-southeast-3:fab89ed8-d220-484a-b5c6-1f0ba7c7f79d",
                ]
              + variable = "cognito-identity.amazonaws.com:aud"
            }

          + principals {
              + identifiers = [
                  + "cognito-identity.amazonaws.com",
                ]
              + type        = "Federated"
            }
        }
    }

  # module.cognito.data.aws_iam_policy_document.gaspi_authenticated will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "gaspi_authenticated" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions = [
              + "sts:AssumeRoleWithWebIdentity",
            ]
          + effect  = "Allow"

          + condition {
              + test     = "ForAnyValue:StringLike"
              + values   = [
                  + "authenticated",
                ]
              + variable = "cognito-identity.amazonaws.com:amr"
            }
          + condition {
              + test     = "StringEquals"
              + values   = [
                  + "ap-southeast-3:fab89ed8-d220-484a-b5c6-1f0ba7c7f79d",
                ]
              + variable = "cognito-identity.amazonaws.com:aud"
            }

          + principals {
              + identifiers = [
                  + "cognito-identity.amazonaws.com",
                ]
              + type        = "Federated"
            }
        }
    }

  # module.cognito.data.aws_iam_policy_document.gaspi_unauthenticated will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "gaspi_unauthenticated" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions = [
              + "sts:AssumeRoleWithWebIdentity",
            ]
          + effect  = "Allow"

          + condition {
              + test     = "ForAnyValue:StringLike"
              + values   = [
                  + "unauthenticated",
                ]
              + variable = "cognito-identity.amazonaws.com:amr"
            }
          + condition {
              + test     = "StringEquals"
              + values   = [
                  + "ap-southeast-3:fab89ed8-d220-484a-b5c6-1f0ba7c7f79d",
                ]
              + variable = "cognito-identity.amazonaws.com:aud"
            }

          + principals {
              + identifiers = [
                  + "cognito-identity.amazonaws.com",
                ]
              + type        = "Federated"
            }
        }
    }

  # module.cognito.data.aws_iam_policy_document.manager_group_assume_role_policy will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "manager_group_assume_role_policy" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions = [
              + "sts:AssumeRoleWithWebIdentity",
            ]

          + condition {
              + test     = "ForAnyValue:StringLike"
              + values   = [
                  + "authenticated",
                ]
              + variable = "cognito-identity.amazonaws.com:amr"
            }
          + condition {
              + test     = "StringEquals"
              + values   = [
                  + "ap-southeast-3:fab89ed8-d220-484a-b5c6-1f0ba7c7f79d",
                ]
              + variable = "cognito-identity.amazonaws.com:aud"
            }

          + principals {
              + identifiers = [
                  + "cognito-identity.amazonaws.com",
                ]
              + type        = "Federated"
            }
        }
    }

  # module.cognito.data.aws_iam_policy_document.ses-sns-access will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "ses-sns-access" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "sns:Publish",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:sns:ap-southeast-3:496940679572:sesDeliveryLogger",
            ]
          + sid       = "AllowSESToPublishToSNS"

          + condition {
              + test     = "StringEquals"
              + values   = [
                  + "496940679572",
                ]
              + variable = "aws:SourceAccount"
            }

          + principals {
              + identifiers = [
                  + "ses.amazonaws.com",
                ]
              + type        = "Service"
            }
        }
    }

  # module.cognito.aws_cognito_identity_pool.gaspi_identity_pool will be updated in-place
  ~ resource "aws_cognito_identity_pool" "gaspi_identity_pool" {
        id                               = "ap-southeast-3:fab89ed8-d220-484a-b5c6-1f0ba7c7f79d"
      ~ tags                             = {
          ~ "Environment" = "dev" -> "uat"
            "NAME"        = "cognito-infrastructure"
            "Owner"       = "gaspi"
        }
      ~ tags_all                         = {
          ~ "Environment" = "dev" -> "uat"
            # (2 unchanged elements hidden)
        }
        # (9 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.cognito.aws_cognito_identity_pool_roles_attachment.gaspi_cognito_roles must be replaced
-/+ resource "aws_cognito_identity_pool_roles_attachment" "gaspi_cognito_roles" {
      ~ id               = "ap-southeast-3:fab89ed8-d220-484a-b5c6-1f0ba7c7f79d" -> (known after apply)
      ~ roles            = {
          - "authenticated"   = "arn:aws:iam::496940679572:role/gaspi_authenticated"
          - "unauthenticated" = "arn:aws:iam::496940679572:role/gaspi_unauthenticated"
        } -> (known after apply) # forces replacement
        # (2 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.cognito.aws_cognito_user_group.admin_group will be updated in-place
  ~ resource "aws_cognito_user_group" "admin_group" {
        id           = "ap-southeast-3_Ta5TVYZ4S/administrators"
        name         = "administrators"
      ~ role_arn     = "arn:aws:iam::496940679572:role/gaspi-admin-group-role" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # module.cognito.aws_cognito_user_pool.gaspi_user_pool will be updated in-place
  ~ resource "aws_cognito_user_pool" "gaspi_user_pool" {
        id                         = "ap-southeast-3_Ta5TVYZ4S"
        name                       = "gaspi-users"
      ~ tags                       = {
          ~ "Environment" = "dev" -> "uat"
            "NAME"        = "cognito-infrastructure"
            "Owner"       = "gaspi"
        }
      ~ tags_all                   = {
          ~ "Environment" = "dev" -> "uat"
            # (2 unchanged elements hidden)
        }
        # (17 unchanged attributes hidden)

      ~ email_configuration {
          ~ from_email_address     = "dian.larasaty@xapiens.id" -> "gxcgaspi@gmail.com"
          ~ source_arn             = "arn:aws:ses:ap-southeast-3:496940679572:identity/dian.larasaty@xapiens.id" -> "arn:aws:ses:ap-southeast-3:496940679572:identity/gxcgaspi@gmail.com"
            # (3 unchanged attributes hidden)
        }

        # (10 unchanged blocks hidden)
    }

  # module.cognito.aws_iam_policy.admin_group_role_policy will be updated in-place
  ~ resource "aws_iam_policy" "admin_group_role_policy" {
        id               = "arn:aws:iam::496940679572:policy/gaspi-admin-group-role-policy"
        name             = "gaspi-admin-group-role-policy"
      ~ tags             = {
          - "Environment" = "dev" -> null
        }
      ~ tags_all         = {
          ~ "Environment" = "dev" -> "uat"
            # (2 unchanged elements hidden)
        }
        # (7 unchanged attributes hidden)
    }

  # module.cognito.aws_iam_policy.manager_group_role_policy will be updated in-place
  ~ resource "aws_iam_policy" "manager_group_role_policy" {
        id               = "arn:aws:iam::496940679572:policy/gaspi-manager-group-role-policy"
        name             = "gaspi-manager-group-role-policy"
      ~ tags             = {
          - "Environment" = "dev" -> null
        }
      ~ tags_all         = {
          ~ "Environment" = "dev" -> "uat"
            # (2 unchanged elements hidden)
        }
        # (7 unchanged attributes hidden)
    }

  # module.cognito.aws_iam_role.admin_group_role will be created
  + resource "aws_iam_role" "admin_group_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = (known after apply)
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "gaspi-admin-group-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = {
          + "Environment" = "uat"
          + "NAME"        = "cognito-infrastructure"
          + "Owner"       = "gaspi"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.cognito.aws_iam_role.gaspi_authenticated will be created
  + resource "aws_iam_role" "gaspi_authenticated" {
      + arn                   = (known after apply)
      + assume_role_policy    = (known after apply)
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "gaspi_authenticated"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = {
          + "Environment" = "uat"
          + "NAME"        = "cognito-infrastructure"
          + "Owner"       = "gaspi"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.cognito.aws_iam_role.gaspi_unauthenticated will be created
  + resource "aws_iam_role" "gaspi_unauthenticated" {
      + arn                   = (known after apply)
      + assume_role_policy    = (known after apply)
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "gaspi_unauthenticated"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = {
          + "Environment" = "uat"
          + "NAME"        = "cognito-infrastructure"
          + "Owner"       = "gaspi"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.cognito.aws_iam_role.manager_group_role will be updated in-place
  ~ resource "aws_iam_role" "manager_group_role" {
      ~ assume_role_policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sts:AssumeRoleWithWebIdentity"
                      - Condition = {
                          - "ForAnyValue:StringLike" = {
                              - "cognito-identity.amazonaws.com:amr" = "authenticated"
                            }
                          - StringEquals             = {
                              - "cognito-identity.amazonaws.com:aud" = "ap-southeast-3:fab89ed8-d220-484a-b5c6-1f0ba7c7f79d"
                            }
                        }
                      - Effect    = "Allow"
                      - Principal = {
                          - Federated = "cognito-identity.amazonaws.com"
                        }
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        id                    = "gaspi-manager-group-role"
        name                  = "gaspi-manager-group-role"
      ~ tags                  = {
          - "Environment" = "dev" -> null
        }
      ~ tags_all              = {
          ~ "Environment" = "dev" -> "uat"
            # (2 unchanged elements hidden)
        }
        # (10 unchanged attributes hidden)
    }

  # module.cognito.aws_iam_role_policy.gaspi_authenticated will be created
  + resource "aws_iam_role_policy" "gaspi_authenticated" {
      + id          = (known after apply)
      + name        = "authenticated_policy"
      + name_prefix = (known after apply)
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "s3:ListBucket"
                      + Condition = {
                          + StringLike = {
                              + "s3:prefix" = [
                                  + "private/${cognito-identity.amazonaws.com:sub}/",
                                  + "private/${cognito-identity.amazonaws.com:sub}/*",
                                ]
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = "arn:aws:s3:::gaspi-dataportal*"
                    },
                  + {
                      + Action   = [
                          + "s3:PutObject",
                          + "s3:GetObject",
                          + "s3:DeleteObject",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:s3:::gaspi-dataportal*/private/${cognito-identity.amazonaws.com:sub}/*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + role        = (known after apply)
    }

  # module.cognito.aws_iam_role_policy.gaspi_unauthenticated will be created
  + resource "aws_iam_role_policy" "gaspi_unauthenticated" {
      + id          = (known after apply)
      + name        = "unauthenticated_policy"
      + name_prefix = (known after apply)
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = "*"
                      + Effect   = "Deny"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + role        = (known after apply)
    }

  # module.cognito.aws_iam_role_policy_attachment.admin_group_role_policy_attachment will be created
  + resource "aws_iam_role_policy_attachment" "admin_group_role_policy_attachment" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::496940679572:policy/gaspi-admin-group-role-policy"
      + role       = "gaspi-admin-group-role"
    }

  # module.cognito.aws_ses_identity_notification_topic.bounce must be replaced
-/+ resource "aws_ses_identity_notification_topic" "bounce" {
      ~ id                       = "dian.larasaty@xapiens.id|Bounce" -> (known after apply)
      ~ identity                 = "dian.larasaty@xapiens.id" -> "gxcgaspi@gmail.com" # forces replacement
        # (4 unchanged attributes hidden)
    }

  # module.cognito.aws_ses_identity_notification_topic.complaint must be replaced
-/+ resource "aws_ses_identity_notification_topic" "complaint" {
      ~ id                       = "dian.larasaty@xapiens.id|Complaint" -> (known after apply)
      ~ identity                 = "dian.larasaty@xapiens.id" -> "gxcgaspi@gmail.com" # forces replacement
        # (4 unchanged attributes hidden)
    }

  # module.cognito.aws_ses_identity_notification_topic.delivery must be replaced
-/+ resource "aws_ses_identity_notification_topic" "delivery" {
      ~ id                       = "dian.larasaty@xapiens.id|Delivery" -> (known after apply)
      ~ identity                 = "dian.larasaty@xapiens.id" -> "gxcgaspi@gmail.com" # forces replacement
        # (4 unchanged attributes hidden)
    }

  # module.cognito.aws_sns_topic.sesDeliveryLogger will be updated in-place
  ~ resource "aws_sns_topic" "sesDeliveryLogger" {
        id                                       = "arn:aws:sns:ap-southeast-3:496940679572:sesDeliveryLogger"
        name                                     = "sesDeliveryLogger"
      ~ tags                                     = {
          - "Environment" = "dev" -> null
        }
      ~ tags_all                                 = {
          ~ "Environment" = "dev" -> "uat"
            # (2 unchanged elements hidden)
        }
        # (30 unchanged attributes hidden)
    }

  # module.cognito.aws_sns_topic_policy.sesDeliveryLogger will be updated in-place
  ~ resource "aws_sns_topic_policy" "sesDeliveryLogger" {
        id     = "arn:aws:sns:ap-southeast-3:496940679572:sesDeliveryLogger"
      ~ policy = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sns:Publish"
                      - Condition = {
                          - StringEquals = {
                              - "aws:SourceAccount" = "496940679572"
                            }
                        }
                      - Effect    = "Allow"
                      - Principal = {
                          - Service = "ses.amazonaws.com"
                        }
                      - Resource  = "arn:aws:sns:ap-southeast-3:496940679572:sesDeliveryLogger"
                      - Sid       = "AllowSESToPublishToSNS"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # module.error-catcher.data.aws_iam_policy_document.lambda-notifyOnError will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "lambda-notifyOnError" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "cloudwatch:DescribeAlarms",
            ]
          + resources = [
              + "arn:aws:cloudwatch:ap-southeast-3:496940679572:alarm:error-catcher-notifyOnError",
            ]
        }
      + statement {
          + actions   = [
              + "events:describeRule",
              + "events:disableRule",
              + "events:enableRule",
            ]
          + resources = [
              + "arn:aws:events:ap-southeast-3:496940679572:rule/error-catcher-notifyOnError-trigger",
            ]
        }
      + statement {
          + actions   = [
              + "s3:ListBucket",
            ]
          + resources = [
              + "arn:aws:s3:::error-catcher-recent-errors-20250708001358184800000001",
            ]
        }
      + statement {
          + actions   = [
              + "s3:GetObject",
              + "s3:PutObject",
            ]
          + resources = [
              + "arn:aws:s3:::error-catcher-recent-errors-20250708001358184800000001/*",
            ]
        }
      + statement {
          + actions   = [
              + "cloudwatch:GetMetricData",
              + "cloudwatch:ListMetrics",
            ]
          + resources = [
              + "*",
            ]
        }
      + statement {
          + actions   = [
              + "logs:FilterLogEvents",
            ]
          + resources = [
              + "arn:aws:logs:ap-southeast-3:496940679572:log-group:/aws/lambda/*",
            ]
        }
      + statement {
          + actions   = [
              + "ses:SendEmail",
            ]
          + resources = [
              + "arn:aws:ses:ap-southeast-3:496940679572:configuration-set/*",
              + "arn:aws:ses:ap-southeast-3:496940679572:identity/*",
            ]
        }
    }

  # module.error-catcher.aws_cloudwatch_event_rule.notifyOnError-trigger will be updated in-place
  ~ resource "aws_cloudwatch_event_rule" "notifyOnError-trigger" {
        id                  = "error-catcher-notifyOnError-trigger"
        name                = "error-catcher-notifyOnError-trigger"
      ~ tags                = {
          - "Environment" = "dev" -> null
        }
      ~ tags_all            = {
          ~ "Environment" = "dev" -> "uat"
            # (2 unchanged elements hidden)
        }
        # (10 unchanged attributes hidden)
    }

  # module.error-catcher.aws_cloudwatch_metric_alarm.notifyOnError-alarm will be updated in-place
  ~ resource "aws_cloudwatch_metric_alarm" "notifyOnError-alarm" {
        id                                    = "error-catcher-notifyOnError"
      ~ tags                                  = {
          - "Environment" = "dev" -> null
        }
      ~ tags_all                              = {
          ~ "Environment" = "dev" -> "uat"
            # (2 unchanged elements hidden)
        }
        # (22 unchanged attributes hidden)
    }

  # module.error-catcher.aws_s3_bucket.recent-errors will be updated in-place
  ~ resource "aws_s3_bucket" "recent-errors" {
        id                          = "error-catcher-recent-errors-20250708001358184800000001"
      ~ tags                        = {
          - "Environment" = "dev" -> null
        }
      ~ tags_all                    = {
          ~ "Environment" = "dev" -> "uat"
            # (2 unchanged elements hidden)
        }
        # (13 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.error-catcher.aws_sns_topic.notifyOnError will be updated in-place
  ~ resource "aws_sns_topic" "notifyOnError" {
        id                                       = "arn:aws:sns:ap-southeast-3:496940679572:error-catcher-notifyOnError"
        name                                     = "error-catcher-notifyOnError"
      ~ tags                                     = {
          - "Environment" = "dev" -> null
        }
      ~ tags_all                                 = {
          ~ "Environment" = "dev" -> "uat"
            # (2 unchanged elements hidden)
        }
        # (30 unchanged attributes hidden)
    }

  # module.pgxflow[0].data.aws_iam_policy_document.ec2_references_policy will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "ec2_references_policy" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "s3:PutObject",
            ]
          + resources = [
              + "arn:aws:s3:::pgxflow-backend-references-20250804065616035600000002/*",
            ]
        }
      + statement {
          + actions   = [
              + "dynamodb:PutItem",
              + "dynamodb:UpdateItem",
            ]
          + resources = [
              + "arn:aws:dynamodb:ap-southeast-3:496940679572:table/pgxflow-references",
            ]
        }
    }

  # module.pgxflow[0].data.aws_iam_policy_document.lambda-batchStarter will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "lambda-batchStarter" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "sqs:DeleteMessage",
              + "sqs:GetQueueAttributes",
              + "sqs:ReceiveMessage",
            ]
          + resources = [
              + "arn:aws:sqs:ap-southeast-3:496940679572:pgxflow-backend-batchSubmitQueue",
            ]
        }
      + statement {
          + actions   = [
              + "sns:Publish",
            ]
          + resources = [
              + "arn:aws:sns:ap-southeast-3:496940679572:pgxflow-backend-initFlow",
            ]
        }
      + statement {
          + actions   = [
              + "lambda:GetAccountSettings",
            ]
          + resources = [
              + "*",
            ]
        }
      + statement {
          + actions   = [
              + "cloudwatch:GetMetricStatistics",
            ]
          + resources = [
              + "*",
            ]
        }
    }

  # module.pgxflow[0].data.aws_iam_policy_document.lambda-batchSubmit will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "lambda-batchSubmit" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "dynamodb:GetItem",
            ]
          + resources = [
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "dynamodb:Query",
            ]
          + resources = [
              + "arn:aws:dynamodb:ap-southeast-3:496940679572:table/sbeacon-dataportal-clinic-jobs",
              + "arn:aws:dynamodb:ap-southeast-3:496940679572:table/sbeacon-dataportal-clinic-jobs/index/project-name-index",
            ]
        }
      + statement {
          + actions   = [
              + "dynamodb:PutItem",
              + "dynamodb:UpdateItem",
            ]
          + resources = [
              + "arn:aws:dynamodb:ap-southeast-3:496940679572:table/sbeacon-dataportal-clinic-jobs",
            ]
        }
      + statement {
          + actions   = [
              + "sqs:SendMessage",
              + "sqs:SendMessageBatch",
            ]
          + resources = [
              + "arn:aws:sqs:ap-southeast-3:496940679572:pgxflow-backend-batchSubmitQueue",
            ]
        }
    }

  # module.pgxflow[0].data.aws_iam_policy_document.lambda-getResultsURL will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "lambda-getResultsURL" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "s3:GetObject",
            ]
          + resources = [
              + "arn:aws:s3:::gaspi-dataportal20250519062439005900000006/projects/*/clinical-workflows/*",
            ]
        }
      + statement {
          + actions   = [
              + "s3:ListBucket",
            ]
          + resources = [
              + "arn:aws:s3:::gaspi-dataportal20250519062439005900000006",
            ]
        }
      + statement {
          + actions   = [
              + "dynamodb:GetItem",
              + "dynamodb:Query",
            ]
          + resources = [
              + "arn:aws:dynamodb:ap-southeast-3:496940679572:table/sbeacon-dataportal-clinic-jobs",
              + (known after apply),
            ]
        }
    }

  # module.pgxflow[0].data.aws_iam_policy_document.lambda-initFlow will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "lambda-initFlow" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "s3:ListBucket",
            ]
          + resources = [
              + "arn:aws:s3:::gaspi-dataportal20250519062439005900000006",
            ]

          + condition {
              + test     = "StringLike"
              + values   = [
                  + "projects/*/project-files/*",
                ]
              + variable = "s3:prefix"
            }
        }
      + statement {
          + actions   = [
              + "s3:GetObject",
            ]
          + resources = [
              + "arn:aws:s3:::gaspi-dataportal20250519062439005900000006/projects/*/project-files/*",
              + "arn:aws:s3:::pgxflow-backend-references-20250804065616035600000002/*",
            ]
        }
      + statement {
          + actions   = [
              + "dynamodb:GetItem",
            ]
          + resources = [
              + "arn:aws:dynamodb:ap-southeast-3:496940679572:table/pgxflow-references",
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "dynamodb:GetItem",
              + "dynamodb:PutItem",
              + "dynamodb:Query",
              + "dynamodb:UpdateItem",
            ]
          + resources = [
              + "arn:aws:dynamodb:ap-southeast-3:496940679572:table/sbeacon-dataportal-clinic-jobs",
              + "arn:aws:dynamodb:ap-southeast-3:496940679572:table/sbeacon-dataportal-clinic-jobs/index/project-name-index",
            ]
        }
      + statement {
          + actions   = [
              + "sns:Publish",
            ]
          + resources = [
              + "arn:aws:sns:ap-southeast-3:496940679572:pgxflow-backend-dbsnp",
              + "arn:aws:sns:ap-southeast-3:496940679572:pgxflow-backend-preprocessor",
            ]
        }
      + statement {
          + actions   = [
              + "lambda:InvokeFunction",
            ]
          + resources = [
              + "arn:aws:lambda:ap-southeast-3:496940679572:function:pgxflow-backend-sendJobEmail",
            ]
        }
    }

  # module.pgxflow[0].aws_dynamodb_table.pgxflow_references will be updated in-place
  ~ resource "aws_dynamodb_table" "pgxflow_references" {
        id                          = "pgxflow-references"
        name                        = "pgxflow-references"
      ~ tags                        = {
          ~ "Environment" = "dev" -> "uat"
            "NAME"        = "pgxflow-backend"
            "Owner"       = "gaspi"
            "backup"      = "true"
        }
      ~ tags_all                    = {
          ~ "Environment" = "dev" -> "uat"
            # (3 unchanged elements hidden)
        }
        # (12 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.pgxflow[0].aws_iam_role_policy.ec2_references_policy will be updated in-place
  ~ resource "aws_iam_role_policy" "ec2_references_policy" {
        id          = "pgxflow_backend_ec2_references_instance_role:pgxflow_backend_ec2_references_policy"
        name        = "pgxflow_backend_ec2_references_policy"
      ~ policy      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = "s3:PutObject"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:s3:::pgxflow-backend-references-20250804065616035600000002/*"
                    },
                  - {
                      - Action   = [
                          - "dynamodb:UpdateItem",
                          - "dynamodb:PutItem",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:dynamodb:ap-southeast-3:496940679572:table/pgxflow-references"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.pgxflow[0].aws_lambda_layer_version.binaries_layer must be replaced
+/- resource "aws_lambda_layer_version" "binaries_layer" {
      ~ arn                         = "arn:aws:lambda:ap-southeast-3:496940679572:layer:pgxflow_backend_binaries_layer:6" -> (known after apply)
      ~ code_sha256                 = "dJlRe704HN7nVtU/2n//NQxeNxkmThY0L00+xp4qQsA=" -> (known after apply)
      - compatible_architectures    = [] -> null
      ~ created_date                = "2025-08-06T07:06:57.276+0000" -> (known after apply)
      ~ id                          = "arn:aws:lambda:ap-southeast-3:496940679572:layer:pgxflow_backend_binaries_layer:6" -> (known after apply)
      ~ layer_arn                   = "arn:aws:lambda:ap-southeast-3:496940679572:layer:pgxflow_backend_binaries_layer" -> (known after apply)
      + signing_job_arn             = (known after apply)
      + signing_profile_version_arn = (known after apply)
      ~ source_code_hash            = "dJlRe704HN7nVtU/2n//NQxeNxkmThY0L00+xp4qQsA=" -> "UbyPZ/PuL+lnGKq80lhv5M1xs02KMoUolFXNMCXCJVA=" # forces replacement
      ~ source_code_size            = 15159116 -> (known after apply)
      ~ version                     = "6" -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # module.pgxflow[0].aws_s3_bucket.lambda-layers-bucket will be updated in-place
  ~ resource "aws_s3_bucket" "lambda-layers-bucket" {
        id                          = "pgxflow-backend-layers-20250804065614849900000001"
      ~ tags                        = {
          ~ "Environment" = "dev" -> "uat"
            "NAME"        = "pgxflow-backend"
            "Owner"       = "gaspi"
        }
      ~ tags_all                    = {
          ~ "Environment" = "dev" -> "uat"
            # (2 unchanged elements hidden)
        }
        # (13 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.pgxflow[0].aws_s3_bucket.pgxflow-bucket will be updated in-place
  ~ resource "aws_s3_bucket" "pgxflow-bucket" {
        id                          = "pgxflow-backend-20250804065616486200000003"
      ~ tags                        = {
          ~ "Environment" = "dev" -> "uat"
            "NAME"        = "pgxflow-backend"
            "Owner"       = "gaspi"
        }
      ~ tags_all                    = {
          ~ "Environment" = "dev" -> "uat"
            # (2 unchanged elements hidden)
        }
        # (13 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.pgxflow[0].aws_s3_bucket.pgxflow-references will be updated in-place
  ~ resource "aws_s3_bucket" "pgxflow-references" {
        id                          = "pgxflow-backend-references-20250804065616035600000002"
      ~ tags                        = {
          ~ "Environment" = "dev" -> "uat"
            "NAME"        = "pgxflow-backend"
            "Owner"       = "gaspi"
        }
      ~ tags_all                    = {
          ~ "Environment" = "dev" -> "uat"
            # (2 unchanged elements hidden)
        }
        # (13 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.pgxflow[0].aws_sqs_queue.batch_submit_dlq will be updated in-place
  ~ resource "aws_sqs_queue" "batch_submit_dlq" {
        id                                = "https://sqs.ap-southeast-3.amazonaws.com/496940679572/pgxflow-backend-batchSubmitDLQ"
        name                              = "pgxflow-backend-batchSubmitDLQ"
      ~ tags                              = {
          ~ "Environment" = "dev" -> "uat"
            "NAME"        = "pgxflow-backend"
            "Owner"       = "gaspi"
        }
      ~ tags_all                          = {
          ~ "Environment" = "dev" -> "uat"
            # (2 unchanged elements hidden)
        }
        # (19 unchanged attributes hidden)
    }

  # module.pgxflow[0].aws_sqs_queue.batch_submit_queue will be updated in-place
  ~ resource "aws_sqs_queue" "batch_submit_queue" {
        id                                = "https://sqs.ap-southeast-3.amazonaws.com/496940679572/pgxflow-backend-batchSubmitQueue"
        name                              = "pgxflow-backend-batchSubmitQueue"
      ~ tags                              = {
          ~ "Environment" = "dev" -> "uat"
            "NAME"        = "pgxflow-backend"
            "Owner"       = "gaspi"
        }
      ~ tags_all                          = {
          ~ "Environment" = "dev" -> "uat"
            # (2 unchanged elements hidden)
        }
        # (19 unchanged attributes hidden)
    }

  # module.sbeacon.data.aws_iam_policy_document.admin-lambda-access will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "admin-lambda-access" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "cognito-idp:*",
            ]
          + resources = [
              + "arn:aws:cognito-idp:ap-southeast-3:496940679572:userpool/ap-southeast-3_Ta5TVYZ4S",
            ]
        }
      + statement {
          + actions   = [
              + "dynamodb:BatchGetItem",
              + "dynamodb:GetItem",
              + "dynamodb:Query",
              + "dynamodb:Scan",
            ]
          + resources = [
              + "arn:aws:dynamodb:ap-southeast-3:496940679572:table/sbeacon-dataportal-users-info",
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "dynamodb:DeleteItem",
              + "dynamodb:GetItem",
              + "dynamodb:Query",
              + "dynamodb:Scan",
            ]
          + resources = [
              + (known after apply),
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "sagemaker:DescribeNotebookInstance",
              + "sagemaker:StopNotebookInstance",
            ]
          + resources = [
              + "arn:aws:sagemaker:ap-southeast-3:496940679572:notebook-instance/*",
            ]
        }
      + statement {
          + actions   = [
              + "lambda:InvokeFunction",
            ]
          + resources = [
              + "arn:aws:lambda:ap-southeast-3:496940679572:function:cognito-sendRegistrationEmail",
            ]
        }
    }

  # module.sbeacon.data.aws_iam_policy_document.athena-full-access will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "athena-full-access" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "athena:GetQueryExecution",
              + "athena:GetQueryResults",
              + "athena:StartQueryExecution",
            ]
          + resources = [
              + "arn:aws:athena:ap-southeast-3:496940679572:workgroup/query_workgroup",
            ]
        }
      + statement {
          + actions   = [
              + "glue:*",
            ]
          + resources = [
              + "*",
            ]
        }
      + statement {
          + actions   = [
              + "s3:*",
            ]
          + resources = [
              + "arn:aws:s3:::gaspi-metadata20250519061956402900000002",
              + "arn:aws:s3:::gaspi-metadata20250519061956402900000002/*",
            ]
        }
      + statement {
          + actions   = [
              + "dynamodb:Query",
            ]
          + resources = [
              + (known after apply),
            ]
        }
    }

  # module.sbeacon.data.aws_iam_policy_document.athena-readonly-access will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "athena-readonly-access" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "athena:GetQueryExecution",
              + "athena:GetQueryResults",
              + "athena:StartQueryExecution",
            ]
          + resources = [
              + "arn:aws:athena:ap-southeast-3:496
```
</details>
<br>

**Warning**: Output length greater than max comment size. Continued in next comment.